/* This file is the descriptor for the Custom python format sample */
{
    "meta" : {
        // label: name of the format as displayed, should be short
        "label": "Custom format sample",

        // description: longer string to help end users understand what this format is
        "description": "",

        // icon: must be one of the FontAwesome 3.2.1 icons, complete list here at https://fontawesome.com/v3.2.1/icons/
        "icon": "icon-puzzle-piece"
    },

    /* whether the format can be selectable as a dataset format */
    "canBeDatasetFormat": true,

    /* whether the format can be used to read files. If true, the get_format_extractor() must return an extractor */
    "canRead": true,

    /* whether the format can be used to write files. If true, the get_output_formatter() must return a formatter */
    "canWrite": true,

    /* whether the format can provide the schema without reading the data. If true, the FormatExtractor must implement read_schema() */
    "canExtractSchema": true,

    /* to get additional options in the export dialogs, list them here */
    "exportOptions": [
        /* {
            "id": "option1",
            "label": "export using this plugin",
            "config" : { "parameter1": "d" },
            "compression": "NONE"
        } */
    ],

    /* A mime type to use when exporting (if not set: the format is assumed to produce binary data) */
    "mime" : {
        /* the mime-type sent to the browser */
        "mimeType": "text/plain",
        /* DSS creates file names by concatenating a unique identifier and this extension */
        "extension": ".csv"
    },


    /* params:
    DSS will generate a formular from this list of requested parameters.
    Your component code can then access the value provided by users using the "name" field of each parameter.

    Available parameter types include:
    STRING, INT, DOUBLE, BOOLEAN, DATE, SELECT, TEXTAREA, PRESET and others.

    For the full list and for more details, see the documentation: https://doc.dataiku.com/dss/latest/plugins/reference/params.html
    */
    "params": [
        {
            "name": "parameter1",
            "label": "User-readable name",
            "type": "STRING",
            "description": "Some documentation for parameter1",
            "mandatory": true
        },
        {
            "name": "parameter2",
            "type": "INT",
            "defaultValue" : 42
            /* Note that standard json parsing will return it as a double in Python (instead of an int), so you need to write
               int(self.config()['parameter2'])
            */
        },

        /* A "SELECT" parameter is a multi-choice selector. Choices are specified using the selectChoice field*/
        {
            "name": "parameter8",
            "type": "SELECT",
            "selectChoices": [
                {
                    "value": "val_x",
                    "label": "display name for val_x"
                },
                {
                    "value": "val_y",
                    "label": "display name for val_y"
                }
            ]
        }
    ]
}
